In [7]:
import pandas as pd
from sqlalchemy import create_engine

In [28]:
oscars_file = "Resources/the_oscar_award.csv"
raw_oscars_df = pd.read_csv(oscars_file)
raw_oscars_df.head()

,year_film,year_ceremony,ceremony,category,name,film,winner
0,1927,1928,1,ACTOR,Richard Barthelmess,The Noose,False
1,1927,1928,1,ACTOR,Emil Jannings,The Last Command,True
2,1927,1928,1,ACTRESS,Louise Dresser,A Ship Comes In,False
3,1927,1928,1,ACTRESS,Janet Gaynor,7th Heaven,True
4,1927,1928,1,ACTRESS,Gloria Swanson,Sadie Thompson,False

In [34]:

oscars_data_df = raw_oscars_df.loc[raw_oscars_df['winner'] == True].rename(columns={'name': 'name of winner'})

oscars_data_df.set_index(['film'], inplace = True)

oscars_data_df

,year_film,year_ceremony,ceremony,category,name of winner,winner
film,,,,,,
The Last Command,1927,1928,1,ACTOR,Emil Jannings,True
7th Heaven,1927,1928,1,ACTRESS,Janet Gaynor,True
The Dove;,1927,1928,1,ART DIRECTION,William Cameron Menzies,True
Sunrise,1927,1928,1,CINEMATOGRAPHY,Charles Rosher,True
Sunrise,1927,1928,1,CINEMATOGRAPHY,Karl Struss,True
...,...,...,...,...,...,...
Parasite,2019,2020,92,WRITING (Original Screenplay),"Screenplay by Bong Joon Ho, Han Jin Won; Story...",True
NaN,2019,2020,92,JEAN HERSHOLT HUMANITARIAN AWARD,Geena Davis,True
NaN,2019,2020,92,HONORARY AWARD,David Lynch,True
NaN,2019,2020,92,HONORARY AWARD,Wes Studi,True
NaN,2019,2020,92,HONORARY AWARD,Lina Wertmüller,True

In [33]:
subset_oscars = oscars_data_df[['category','film']]

oscars_by_film =subset_oscars.groupby('film').count().sort_values('category', ascending = False)

oscars_by_film.head(30)

                                               category
film
Titanic                                              12
The Lord of the Rings: The Return of the King        11
Ben-Hur                                              11
West Side Story                                      10
Gigi                                                  9
The English Patient                                   9
The Last Emperor                                      9
Gandhi                                                8
On the Waterfront                                     8
Slumdog Millionaire                                   8
Amadeus                                               8
From Here to Eternity                                 8
Cabaret                                               8
My Fair Lady                                          8
Gone with the Wind                                    8
The Sting                                             7
Gravity                                               7
Schindler's List                                      7
Dances With Wolves                                    7
Lawrence of Arabia                                    7
Out of Africa                                         7
Shakespeare in Love                                   7
The Bridge on the River Kwai                          7
The Best Years of Our Lives                           7
Going My Way                                          7
Patton                                                7
All about Eve                                         6
An American in Paris                                  6
The Godfather Part II                                 6
Mrs. Miniver                                          6

In [35]:
# import pgAdmin password 
from my_secrets import pw

In [36]:
# create connection to the database and the engine
rds_connection_string = f"postgres:{pw}@localhost:5432/movies_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [37]:
# upload dataframes to SQL database
oscars_data_df.to_sql(name='oscars_data', con=engine, if_exists='append', index=False)
oscars_by_film.to_sql(name='total_oscars_by_film', con=engine, if_exists='append', index=False)

In [38]:
# pull table names to test
engine.table_names()

['oscars_data', 'total_oscars_by_film']